Revit 2024 API
ConceptualConstructionType.IsValidConceptualConstructionIdForCategory Method
 Indicate if a ConceptualConstruction is appropriate to assign to a MassSurfaceData of a particular Mass subcategory.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool IsValidConceptualConstructionIdForCategory(
	Document ccda,
	ElementId constructionTypeId,
	ElementId massSubcategoryId
)
Visual Basic
Public Shared Function IsValidConceptualConstructionIdForCategory ( _
	ccda As Document, _
	constructionTypeId As ElementId, _
	massSubcategoryId As ElementId _
) As Boolean
Visual C++
public:
static bool IsValidConceptualConstructionIdForCategory(
	Document^ ccda,
	ElementId^ constructionTypeId,
	ElementId^ massSubcategoryId
)
Parameters
ccda
Type: Autodesk.Revit.DB.Document
 The document.
constructionTypeId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the ConceptualConstructionType.
massSubcategoryId
Type: Autodesk.Revit.DB.ElementId
 The ElementId of the Mass subcategory.
Return Value
 Returns true if valid, false otherwise
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The ElementId constructionTypeId is not an id of a ConceptualConstructionType. -or- The mass sub-category is none of the OST_MassInteriorWall, OST_MassExteriorWall, OST_MassExteriorWallUnderground, OST_MassWallsAll, OST_MassRoof, OST_MassFloor, OST_MassSlab, OST_MassFloorsAll, OST_MassShade, OST_MassGlazing, OST_MassSkylights, OST_MassGlazingAll or OST_MassOpening.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace